You are given a Pandas DataFrame containing information about employees in a company. The columns of the DataFrame are:

'Employee': The name of the employee.
'Department': The department in which the employee works.
'Salary': The salary of the employee.
Your task is to:

Find the employee with the highest salary in each department.
Filter out departments where the highest salary is less than $100,000.

In [1]:
data = {
    'Employee': ['John', 'Jane', 'Mike', 'Sara', 'Tom', 'Anna'],
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Salary': [75000, 80000, 120000, 95000, 110000, 78000]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(data)
df

  Employee Department  Salary
0     John         HR   75000
1     Jane         HR   80000
2     Mike         IT  120000
3     Sara         IT   95000
4      Tom    Finance  110000
5     Anna    Finance   78000

In [4]:
highest_salary = df.loc[df.groupby(['Department'])['Salary'].idxmax()]
highest_salary

  Employee Department  Salary
4      Tom    Finance  110000
1     Jane         HR   80000
2     Mike         IT  120000

In [5]:
b = highest_salary[highest_salary['Salary'] >= 100000]
b

  Employee Department  Salary
4      Tom    Finance  110000
2     Mike         IT  120000